InformationRegisters/СтратегииРедактированияНомеровОбъектов/СтратегииРедактированияНомеровОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтратегииРедактированияНомеровОбъектов</name>
  <resources>
    <name>СтратегияРедактированияНомераОбъекта</name>
    <type>
      <types>EnumRef.СтратегияРедактированияНомеровОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>абс_КонтролироватьДлинуНомераДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CommonModules/абс_ОбменДанными/Module.bsl
Процедура абс_ПередЗаписьюУстановитьХозОперациюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеИсточника = Источник.Метаданные();
	
	Если МетаданныеИсточника.Реквизиты.Найти("абс_ХозяйственнаяОперация") = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.абс_ХозяйственнаяОперация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Источник.абс_ХозяйственнаяОперация = абс_ПроцедурыСПовторнымВызовом.ПолучитьХозяйственнуюОперациюДляДокументаПоУмолчанию(МетаданныеИсточника.Имя);
	
КонецПроцедуры

Процедура абс_ВыгрузкаДанныхПУБ77(НастройкаВыгрузкиДанныхПУБ77) Экспорт
	
	
	
КонецПроцедуры

Функция НайтиХозОперациюПоНаименованию(НаименованиеХозОперации, ИмяДокумента) Экспорт
	
	ТипДокумента = Тип("ДокументСсылка." + ИмяДокумента);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ХозяйственныеОперацииПУБ77.Ссылка
	|ИЗ
	|	Справочник.абс_ХозяйственныеОперацииПУБ77 КАК абс_ХозяйственныеОперацииПУБ77
	|ГДЕ
	|	абс_ХозяйственныеОперацииПУБ77.ТипМетаданных.ТипМетаданныхСсылка = &ТипЗначенияПустаяСсылка
	|	И абс_ХозяйственныеОперацииПУБ77.Наименование = &Наименование");
	
	Запрос.УстановитьПараметр("ТипЗначенияПустаяСсылка", Новый(Тип("ДокументСсылка." + ИмяДокумента)));
	Запрос.УстановитьПараметр("Наименование", НаименованиеХозОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;

	
КонецФункции

Процедура абс_ПередЗаписьюПроверкаДлиныНомераДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеИсточника = Источник.Метаданные();
	
	КонтрольДлиныНомера = ПолучитьПризнакКонтроляДлиныНомераДляОбъекта(МетаданныеИсточника);
	
	Если НЕ КонтрольДлиныНомера Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СтрДлина(СокрЛП(Источник.Номер)) = МетаданныеИсточника.ДлинаНомера Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("Номер документа должен состоять из " + МетаданныеИсточника.ДлинаНомера + " символов!", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПризнакКонтроляДлиныНомераДляОбъекта(МетаданныеОбъекта)
	
	Перем ТипОбъекта;
	
	Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		ТипОбъекта = "Справочники";
	ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		ТипОбъекта = "Документы";
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта) Тогда
		ТипОбъекта = "ПланыВидовХарактеристик";
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтратегииРедактированияНомеровОбъектов.абс_КонтролироватьДлинуНомераДокумента
	|ИЗ
	|	РегистрСведений.СтратегииРедактированияНомеровОбъектов КАК СтратегииРедактированияНомеровОбъектов
	|ГДЕ
	|	СтратегииРедактированияНомеровОбъектов.ТипОбъекта = &ТипОбъекта
	|	И СтратегииРедактированияНомеровОбъектов.ВидОбъекта = &ВидОбъекта";
	
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("ВидОбъекта", МетаданныеОбъекта.Имя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.абс_КонтролироватьДлинуНомераДокумента;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции // ПолучитьСтратегиюАвтонумерацииДляОбъекта()
